## Production: ecr
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 3 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                         NAME                          |
|--------|-------------------------------------------------------|
| add    | `aws_iam_policy.pr-review-env-lambda`                 |
|        | `aws_iam_role.pr-review-env-lambda`                   |
|        | `aws_iam_role_policy_attachment.pr-review-env-lambda` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_iam_policy.pr-review-env-lambda will be created
  + resource "aws_iam_policy" "pr-review-env-lambda" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "pr-review-env-lambda"
      + path      = "/"
      + policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:PutLogEvents",
                          + "logs:CreateLogStream",
                          + "logs:CreateLogGroup",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:logs:ca-central-1:521732289257:*"
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # aws_iam_role.pr-review-env-lambda will be created
  + resource "aws_iam_role" "pr-review-env-lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "pr-review-env-lambda"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy_attachment.pr-review-env-lambda will be created
  + resource "aws_iam_role_policy_attachment" "pr-review-env-lambda" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "pr-review-env-lambda"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_ecr_repository.website_staging_container"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.pr-review-env-lambda"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.pr_review_env"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.pr-review-env-lambda"]

23 tests, 19 passed, 4 warnings, 0 failures, 0 exceptions

```

</details>
